var a = ["banana", "orange", "mangoo"]
var b = a.splice(1,1,"red", "purple")
document.write(a)

//اسپلایس از شیفت و پاپ و بقیه کاربردی تره
// شماره اول میگه می خوای توی کدوم خونه پارامتر رو جایگزین کنی
// عدد دوم میگه خونه چندم بعد عدد اول حذف شه
//آخری باید بنویسی که چی می خواد اضافه شه



var x = [1,3,5,7]
var y = [2,4,6,8]
var z = [11,22,33,44]

console.log(x.concat(y,z))

//کانکت دو تا رو میریزه توی هم

console.log(x.slice(0))
//بریدن از 0 (نبریدن!)
console.log(x.slice(1))
//بریدن از 1 (تا اولی را بریدن)
console.log(x.slice(2))
//بریدن از 2 (تا دومی را بریدن)
console.log(x.slice(3))
//بریدن از 3 (تا سومی را بریدن)
console.log(x.slice(1,3))
//بازه هم میشه تعریف کرد
