//یک محدوده بسته تعریف می کنیم
// {
//     var a = 2
//     let b = 4
// }
// console.log(a);
// console.log(b);

//عه! دیدی چی شد؟
//خب فرق لت و ور همینه دیگه
//وقتی میگی ور ، خارج هر محدوده ای میتونی صداش بزنی
// اما لت اینجوری نیست و فقط توی محدوده مشخص شده کار می کنه
// و خارج محدوده تعریف نمیشه


//حالا مشکلی که 
//let
//ایجاد می کنه چیه؟

// if(true){
//     var c = 1
//     let d = 5
// }

// console.log(c);
// console.log(d);
//دیدی! نمیتونی از
//d
//لاگ بگیری چون محدوده بسته هست




//حالا یه چیز عجیب تر
//توی فانکشن ها یه استثنا هست

// function sum(){
//     var e = 8
//     let f = 9
// }

// console.log(e);
// console.log(f);

//حالا ببین 
// توی فانکشن ها حتی ور هم بیرونش تعریف نمیشه
// لت که بیرون اصلااااا تعریف نمیشه




////////////////////////////////////






//حالا 
//const
// دقیقا شبیه 
//let 
//است اما برای ثابت هاست


let a1 = "sepehr"
console.log(a1);


//حالا!
const a2 = 'parham'
console.log(a2);
//دیگه الان ما یک ثابت رو تعریف کردیم و به هیچچچچچ وجه تغییر نمی کنه
//اصلا متغیر نیست
//تغییر نمی کنه که!
//مثلا اگه بخوایم اینجوری تغییر  کنیم ارور میده

// var a2 = sara





